In [1]:
import pandas as pd
import numpy as np

In [4]:
data=[[10,13,np.nan,7],
      [2,np.nan,3,1],
      [21,31,np.nan,51],
      [21,31,np.nan,51]]
dataDF=pd.DataFrame(data)
dataDF

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [5]:
dataDF.isnull().sum()

0    0
1    1
2    3
3    0
dtype: int64

In [7]:
# 결측치 처리 - (1) 삭제 dropna()
# [기본값] 행 방향, 한개라도 NaN이 있으면 삭제
dataDF.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [9]:
dataDF.dropna(axis=1)

    0   3
0  10   7
1   2   1
2  21  51
3  21  51

In [10]:
# [기본값 변경] 행방향, 모두가 NaN이 있으면 삭제
dataDF.dropna(how='all')

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [11]:
# [기본값 변경] 열방향, 모두가 NaN이 있으면 삭제
dataDF.dropna(axis=1,how='all')

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [14]:
# [기본값 변경] 컬럼 또는 행의 정상 데이터의 최소 갯수 임계값 설정
dataDF.dropna(axis=1,thresh=3)

    0     1   3
0  10  13.0   7
1   2   NaN   1
2  21  31.0  51
3  21  31.0  51

In [29]:
# [기본값 변경] 지정 컬럼에 NaN값이 있을때 행이나 열 기준 삭제
dataDF.dropna(subset=[2])

   0   1    2  3
1  2 NaN  3.0  1